[
    {
        "title": "2022 FIFA World Cup",
        "description": "From a dataset of all matches' statistics, there is a complete exploratory analysis using Python that leads to an outstanding understanding of what was this last World Cup. ",
        "image": 1,
        "url": "https://github.com/wssantiago/2022-fifa-wc",
        "tech": "Pandas and Seaborn."
    },
    {
        "title": "2022 SISU registrations analysis",
        "description": "This Jupyter Notebook refers to a general overview regarding how the 2022 SISU successful candidates, as well as their grades by area of ​​knowledge, are distributed throughout Brazil.",
        "image": 2,
        "url": "https://github.com/wssantiago/sisu-2022",
        "tech": "Pandas and Seaborn."
    },
    {
        "title": "Binary classification model",
        "description": "A credit granting risk model for deciding wheter to grant the requested credit to a client. The datasets used were analysed in an exploratory way and also visualised before model training.",
        "image": 3,
        "url": "https://github.com/wssantiago/credit-granting",
        "tech": "Pandas, Seaborn, NumPy and scikit-learn"
    },
    {
        "title": "API for ML model monitoring",
        "description": "An API implemented in python for volumetry and model score monitoring, as well as datasets adherence. The endpoint are specified in the repository.",
        "image": 4,
        "url": "https://github.com/wssantiago/model-monitoring",
        "tech": "FastAPI and scikit-learn"
    },
    {
        "title": "A data visualiser",
        "description": "A web application for graphical visualization of the formatted input data. It is a simple but complete client server application to consolidate the knowledges surrounding web development.",
        "image": 5,
        "url": "https://github.com/wssantiago/data-visualizer",
        "tech": "React and Node.js"
    },
    {
        "title": "ResNet50 and image compression",
        "description": "The ResNet50 model from tensorflow has its performance tested in this project. Using the K-Means unsupervised learning algorithm, this model behaviour is analysed while classifying k-clustered compressed images.",
        "image": 6,
        "url": "https://github.com/wssantiago/resnet50-img-compression",
        "tech": "Tensorflow, scikit-learn and Seaborn"
    },
    {
        "title": "Autonomous Search Agent",
        "description": "This p5.js project visually represents this autonomous agent whose purpose is to seek the food inside a completely observable environment considering the most common searching algorithms.",
        "image": 7,
        "url": "https://github.com/mateuseap/projeto-si",
        "tech": "p5.js"
    },
    {
        "title": "A password manager",
        "description": "An application that allows managing various login and password data and registering them RSA-encrypted into an SQL database, using the python sqlite3 module, through an interactive python tkinter GUI.",
        "image": 8,
        "url": "https://github.com/wssantiago/password-manager",
        "tech": "Python and SQL"
    },
    {
        "title": "A relational database",
        "description": "This SQL project stands for managing students and professors' data while members of an university. The final model implements both DDL and DML statements.",
        "image": 9,
        "url": "https://github.com/wssantiago/FOLLOW-GDI",
        "tech": "SQL"
    }
]